title: Reverse Shell Connection Detection
description: >
  Write a rule to identify reverse shell establishment behavior in command lines. 
  Focus on recognizing patterns where network tools (such as nc, netcat) and shell commands 
  (such as bash, sh, cmd) appear along with IP addresses and port numbers.
status: experimental
author: Luca Vaudano
level: medium
logsource:
    product: any
    category: any
detection:
  selection_network_tools:
    CommandLine|contains:
      - 'nc '
      - 'netcat '
      - 'ncat '
      - 'socat '
      - 'telnet '

  selection_shells:
    CommandLine|contains:
      - '/bin/sh'
      - '/bin/bash'
      - 'cmd.exe'
      - 'powershell.exe'

  selection_ip:
    CommandLine|re: '\b\d{1,3}(\.\d{1,3}){3}\b'

  selection_nc_exec:
    CommandLine|contains:
      - 'nc -e'
      - 'nc -c'

  selection_socat_exec:
    CommandLine|contains: 'socat exec:'

  selection_bash_tcp:
    CommandLine|contains: '/dev/tcp/'

  condition: (selection_network_tools and selection_ip and selection_shells)
           or selection_nc_exec
           or selection_socat_exec
           or selection_bash_tcp
