title: Potential Linux Credential File Access
description: >
  Use SIEM query statements to identify operations that view /etc/passwd and /etc/shadow files, such as common file viewing operations like cat /etc/passwd.
status: experimental
author: Luca Vaudano
level: medium
logsource:
    product: any
    category: any
detection:
    selection:
        CommandLine|contains:
            - '/etc/*'
    condition: selection